# Напишите программу, которая после запуска выведет следующий результат:

# Каждый
# охотник
# желает
# знать,
# где
# сидит
# фазан

print("Каждый", "охотник", "желает", "знать,", "где", "сидит", "фазан", sep="\n")