# Коллеги Фёдора увлеклись шифрованием и шифруют свои имена и фамилии. Больше всего им понравился шифр Цезаря. Для этого нужно записать слово и заменить каждый символ на символ, находящийся на несколько позиций слева или справа по алфавиту.
#
# Например, при сдвиге 2 направо, имя Фёдор будет зашифровано в Цзёрт.
#
# Для шага сдвига 1 направо зашифруй коллег Фёдора. Из зовут Анна Иванова, Пётр Сидоров и Олег Белов. Выведи, что у них получилось.

print('Бооб Йгбопгб')
print('Ржус Тйепспг')
print('Пмёд Вёмпг')