# Напишите программу, которая считывает со стандартного потока ввода (консоли) фамилию, имя и отчество человека (именно в таком порядке) и выводит их в следующем виде:
#
# Имя Отчество Фамилия

surname = input()
name = input()
patronymic = input()

print(name, patronymic, surname)