# Напишите программу, которая выводит результат деления 10 на 3 с точностью 4 знака после запятой

result = 10 / 3
formatted_result = "{:.4f}".format(result)
print(formatted_result)