# Объявите в своей программе 5 переменных: s1 = 'ПАМ' s2 = 'ПА' s3 = 'РА' s4 = 'РУ' s5 = 'РАМ'
#
# С помощью конкатенации получите и выведите следующие выражения (в таком же порядке):
#
# ПАМ-ПА-РА-ПАМ-ПАМ
# ПА-ПА-РИ-РУ-РАМ
# ПА-ПА-РА-РА-РАМ
# ПА-РУ-РИ-РУ-РАМ-ПАМ-ПАМ

s1 = 'ПАМ'
s2 = 'ПА'
s3 = 'РА'
s4 = 'РУ'
s5 = 'РАМ'

print(s1 + '-' + s2 + '-' + s3 + '-' + s1 + '-' + s1)
print(s2 + '-' + s2 + '-' + 'РИ' + '-' + s4 + '-' + s5)
print(s2 + '-' + s2 + '-' + s3 + '-' + s3 + '-' + s5)
print(s2 + '-' + s4 + '-' + 'РИ' + '-' + s4 + '-' + s5 + '-' + s1 + '-' + s1)