# Трое друзей - Аня, Олег и Юля решили пообедать в кафе. Официант подал каждому счет. Они решили оставить официанту чаевые в размере 15% от счета. Составьте программу, которая выведет сумму чаевых, которую получил официант.

bill1 = int(input())
bill2 = int(input())
bill3 = int(input())

tip = (bill1 + bill2 + bill3) * 0.15

print(tip)





