# Соня увлеклась нумерологией и решила проверить идею влияния чисел в своей жизни. Теперь, выполняя домашнее задание по математике Соня решает только задачи, номер которых кратен 3. Определите, сколько задач выполнит Соня, если учитель задал задачи с 1 по N?

n = int(input())
num_of_problems = n // 3

print(num_of_problems)