# Напишите программу, которая выводит на экран четверостишие:
#
# Унылая пора! Очей очарованье!
# Приятна мне твоя прощальная краса -
# Люблю я пышное природы увяданье,
# В багрец и золото одетые леса.
# А.С. Пушкин

print("Унылая пора! Очей очарованье!")
print("Приятна мне твоя прощальная краса -")
print("Люблю я пышное природы увяданье,")
print("В багрец и золото одетые леса.")
print("А.С. Пушкин")