# Напишите программу, которая выводит следующее четверостишие:
#
# Унылая пора! Очей очарованье!
# Приятна мне твоя прощальная краса -
# Люблю я пышное природы увяданье,
# В багрец и золото одетые леса.
# А.С. Пушкин
# Для хранения строк используйте отдельные переменные.

s1 = "Унылая пора! Очей очарованье!"
s2 = "Приятна мне твоя прощальная краса -"
s3 = "Люблю я пышное природы увяданье,"
s4 = "В багрец и золото одетые леса."
s5 = "А.С. Пушкин"

print(s1, s2, s3, s4, s5, sep="\n")