# Напишите программу, которая при помощи конкатенации создаст из строк
#
# s1 = 'Унылая пора! Очей очарованье! \nПриятна мне твоя проща'
# s2 = 'льная краса -'
# s3 = 'Люблю я пышное природы увяданье,'
# s4 = 'В багрец и золото одетые леса.\n'
# s5 = 'А.С. Пушкин'
# одну строку и выведет её.

s1 = 'Унылая пора! Очей очарованье! \nПриятна мне твоя проща'
s2 = 'льная краса -'
s3 = 'Люблю я пышное природы увяданье,'
s4 = 'В багрец и золото одетые леса.\n'
s5 = 'А.С. Пушкин'

result = s1 + s2 + s3 + s4 + s5
print(result)